"""Дано расстояние в метрах. Найти число полных километров в нем."""

kilometers = int(input("Введите расстояние в метрах...\n"))//1000
print(f"Полное число километров: {str(kilometers)}")
