"""Дано число. Проверьте, четное оно или нет. Если четное выведите True,
если нечетное –False. Решение должно быть в одну инструкцию."""

print(int(input("Введите число...\n"))%2==0)