"""Вывести на экран текст «Silence is golden». Каждое слово должно быть на новой строке."""

print("Silence\nis\ngolden")